text = {
    'welcome'                       : 'به ربات آزمایشگاه حیوانات خانگی خوش آمدید',
    'unknown_message'               : 'پیام اشتباه!لطفا از گزینه های موجود انتخاب نمایید',
    'home'                          : 'یکی از موارد زیر را انتخاب نمایید',
}
text_admin = {
    'name_test_group_input'         : 'نام گروه آزمایش را وارد کنید',
    'name_test_group_unique'        : 'نام گروم آزمایش تکراری است',
    'name_test_group_check'         : 'برای نام گروه آزمایش بیشتر از 45 کاراکتر مجاز نیست',
    'success_create_test_group'     : 'گروه آزمایش {} با موفقیت ایجاد شد',
    'chooce_test_group'             : 'کروه آزمایش را انتخاب کنید',
    'test_group_not'                : 'ابتدا گروه آزمایش را تعریف کنید',
    'template_test'                 : 'تمام آیتم ها را طبق الگوی زیر کپی کرده و بدون فاصله پر و در غالب یک پیام ارسال کنید \n(توجه : آیتم parameter-type-price اجباری است)',
    'template_input_test'           : 'parameter:\ntype:quality-quantity\nprice:\nunit:\nminimum_range:\nmaximum_range:\nanalyze_date:\ndescription:',
    'parameter_test_check'          : 'برای parameter بیشتر از 45 کاراکتر مجاز نیست',
    'parameter_test_null'           : 'ورود آیتم parameter اجباری است',
    'parameter_test_unique'         : 'نام پارامتر تکراری است',
    'type_test_check'               : 'برای type باید گزینه های quality یا quantity را وارد کنید',
    'type_test_null'                : 'ورود آیتم type اجباری است',
    'price_test_check'              : 'برای price اعداد تا 10 رقم صحیح و 2 رقم اعشار مجاز است',
    'price_test_null'               : 'ورود آیتم price اجباری است',
    'unit_test_check'               : 'برای unit بیشتر از 10 کاراکتر مجاز نیست',
    'minimum_range_test_check'      : 'برای minimum_range اعداد تا 5 رقم صحیح و 3 رقم اعشار مجاز است',
    'maximum_range_test_check'      : 'برای maximum_range اعداد تا 5 رقم صحیح و 3 رقم اعشار مجاز است',
    'analyze_date_test_check'       : 'برای analyze_date عدد بین 1 تا 30 مجاز است',
    'description_test_check'        : 'برای description بیشتر از 255 کاراکتر مجاز نیست',
    'test_item_check'               : 'آیتم غیرمجاز وارد شده است',
    'send_full_test_item'           : 'ارسال تمام آیتم ها اجباری است',
    'success_create_test'           : 'آزمایش {} با موفقیت ایجاد شد',
    'chooce_species'                : 'گونه حیوان را انتخاب کنید',
    'cat'                           : 'گربه🐱',
    'dog'                           : 'سگ🐶',
    'bird'                          : 'پرنده🐦',
    'rabbit'                        : 'خرگوش🐰',
    'rat'                           : 'موش🐹',
    'other'                         : 'سایر',
    'name_breed_input'              : 'نام نژاد حیوان را وارد کنید',
    'name_breed_unique'             : 'نام نژاد حیوان تکراری است',
    'name_breed_check'              : 'برای نام نژاد حیوان بیشتر از 45 کاراکتر مجاز نیست',
    'specifications_breed'          : 'آیا میخواهید برای این نژاد مشخصات تعریف کنید',
    'yes'                           : 'بله',
    'no'                            : 'خیر',
    'success_create_breed'          : 'نژاد حیوان {} با موفقیت ایجاد شد',
    'specifications_breed_input'    : 'مشخصات نژاد حیوان را وارد کنید',
    'specifications_breed_check'    : 'برای مشخصات نژاد بیشتر از 255 کاراکتر مجاز نیست',


}
text_user = {
    'compelete_edit_account'        : 'اطلاعات حساب',
    'first_name'                    : 'نام',
    'last_name'                     : 'نام خانوادگی',
    'username'                      : 'نام کاربری',
    'national_code'                 : 'کد ملی',
    'phone'                         : 'شماره تماس',
    'address'                       : 'آدرس',
    'user_data'                     : 'اطلاعات حساب کاربری',
    'user_data_edit'                : 'برای ویرایش روی دکمه هر گزینه کلیک کنید',
    'first_name_edit'               : 'نام جدید را وارد کنید',
    'first_name_check'              : 'برای نام بیشتر از 64 کاراکتر مجاز نیست',
    'first_name_success'            : 'نام جدید با موفقیت ثبت شد',
    'last_name_edit'                : 'نام خانوادگی جدید را وارد کنید',
    'last_name_check'               : 'برای نام خانوادگی بیشتر از 64 کاراکتر مجاز نیست',
    'last_name_success'             : 'نام خانوادگی جدید با موفقیت ثبت شد',
    'username_edit'                 : 'نام کاربری جدید را وارد کنید',
    'username_unique'               : 'این نام کاربری وجود دارد..نام کاربری دیگری وارد کنید',
    'username_check'                : 'برای نام کابری بیشتر از 32 کاراکتر مجاز نیست',
    'username_rules'                : 'نام کاربری می تواند شامل حروف انگلیسی کوچک و اعداد 0 تا 9 و کاراکتر _ باشد',
    'username_success'              : 'نام کاربری جدید با موفقیت ثبت شد',
    'national_code_edit'            : 'کد ملی جدید را وارد کنید',
    'national_code_check'           : 'برای کد ملی 10 رقم مجاز است',
    'national_code_success'         : 'کد ملی جدید با موفقیت ثبت شد',
    'phone_edit'                    : 'شماره موبایل جدید را وارد کنید',
    'phone_check'                   : 'برای شماره موبایل الگوهای زیر مجاز است\n09352993173\n00989352993173\n+989352993173',
    'phone_success'                 : 'شماره موبایل جدید با موفقیت ثبت شد ',
    'address_edit'                  : 'آدرس جدید را وارد کنید',
    'address_check'                 : 'برای آدرس بیشتر از 255 کاراکتر مجاز نیست',
    'address_success'               : 'آدرس جدید با موفقیت ثبت شد'
}

buttons = {
    'home'                          : 'منوی اصلی',
}


buttons_admin = {
    'create_test_group'             : 'تعریف گروه آزمون',
    'create_test'                   : 'تعریف آزمایش',
    'create_species'                : 'تعریف گونه حیوان',
    'create_breed'                  : 'تعریف نژاد حیوان',

}
buttons_user = {
    'account'                       : 'حساب کاربری',

}